# -*- coding: utf-8 -*-
from Sources.new_enbek.main import start_priem_enbek, start_uvol_enbek, start_perevod_enbek

arr_uvol = [{'ФИО': 'Әлдибек Д.М.', 'Дата расторжение': '03.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '780329300070'}, {'ФИО': 'Набоков В.В.', 'Дата расторжение': '10.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '640926301957'}, {'ФИО': 'Дуисбеков Т.Ж.', 'Дата расторжение': '12.10.2022', 'Причина': 'Достижение работником пенсионного возраста', 'ИИН': '590929301941'}, {'ФИО': 'Әміров Б.М.', 'Дата расторжение': '14.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '960225300200'}, {'ФИО': 'Бакун Е.В.', 'Дата расторжение': '16.10.2022', 'Причина': 'Достижение работником пенсионного возраста', 'ИИН': '590915300709'}, {'ФИО': 'Елемесов К.Е.', 'Дата расторжение': '17.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '850207300458'}, {'ФИО': 'Ахметов К.К.', 'Дата расторжение': '17.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '730518301195'}, {'ФИО': 'Нуров Е.Б.', 'Дата расторжение': '18.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '871003300267'}, {'ФИО': 'Меналимов С.С.', 'Дата расторжение': '19.10.2022', 'Причина': 'Достижение работником пенсионного возраста', 'ИИН': '590918301703'}, {'ФИО': 'Филатова И.М.', 'Дата расторжение': '22.10.2022', 'Причина': 'Достижение работником пенсионного возраста', 'ИИН': '620321402235'}, {'ФИО': 'Амангельдинов Ж.С.', 'Дата расторжение': '31.10.2022', 'Причина': 'По инициативе работника', 'ИИН': '930323301996'}]

start_uvol_enbek(arr_uvol)
# start_perevod_enbek(arr_pereme)


# 30.11.2022